Repository: 84000/data-translation-memory
Catalog: Toh_96-The_Miraculous_Play_of_Manjusri-v2.tmx
Source language: bo
Languages: en

source: སྲིང་མོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་བདག་ལ་ཡང་ཉོན་མོངས་པ་མེད་ལ། གཞན་དག་ཉོན་མོངས་པ་ལས། རབ་ཏུ་ཐར་བ་ལ་ཡང་ཤིན་དུ་བརྩོན་པ་དེ་ནི་ཉོན་མོངས་པ་མེད་པའོ་ཞེས་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེགཞན་དག་ཉོན་མོངས་པ་ལས་རབ་ཏུ་ཐར་བར་བྱེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཡང་དག་ཕུལ་ལོ། །
en: “Further, sister, as the Tathāgata says, one who is without afflicted mental states but strives to release others from afflicted mental states is to be called one without afflicted mental states , so freeing others from the afflicted mental states is how the bodhisatva adopts vigor.”

source: བུ་མོས་སྨྲས་པ། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཡང་དག་ཕུལ་གང་ལགས།
en: “Mañjuśrī, how does the bodhisatva adopt vigor?” asked the girl.

source: སྟོང་པ་ཉིད་ལ་སོ་སོར་རྟོག་པའི་རྗེས་སུ་འཇུག་ཅིང་ལྟ་བ་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བ་དང་།
en: “To be in harmony with the discernment of emptiness but still have compassion for beings who act according to viewpoints;

source: མཚན་མ་མེད་པ་ལ་སོ་སོར་རྟོག་པའི་རྗེས་སུ་འཇུག་ཅིང་མཚན་མ་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བ་དང་།
en: to be in harmony with the discernment of the absence of distinguishing marks but still have compassion for beings who act according to distinguishing marks;

source: སྨོན་པ་མེད་པ་ལ་སོ་སོར་རྟོག་པའི་རྗེས་སུ་འཇུག་ཅིང་སྨོན་པ་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བ་དང་།
en: to be in harmony with the discernment of the absence of wishes but still have compassion for beings who act according to wishes;

source: མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ལ་སོ་སོར་རྟོག་པའི་རྗེས་སུ་འཇུག་ཅིང་མངོན་པར་འདུ་བྱེད་པ་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བ་དང་།
en: to be in harmony with the discernment of the absence of conditioning but still have compassion for beings who act according to conditioning;

source: སྐྱེ་བ་མེད་ཅིང་འཆི་འཕོ་བ་མེད་པ་ལ་སོ་སོར་རྟོག་པའི་རྗེས་སུ་འཇུག་ཅིང་རྒ་བ་དང་ཤི་བར་འདུ་ཤེས་པའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བ་དང་།
en: to be in harmony with the discernment of the absence of birth and death but still have compassion for beings who entertain the concepts of old age and death;

source: སྐྱེ་བ་མེད་པ་ལ་སོ་སོར་རྟོག་པའི་རྗེས་སུ་འཇུག་ཅིང་སྐྱེ་བ་དང་འཇིག་པར་འདུ་ཤེས་པའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བ་དང་།
en: to be in harmony with the discernment of the absence of birth but still have compassion for beings who entertain the concepts of origination and destruction;

source: ཉན་ཐོས་སུ་ངེས་པ་ལ་སོ་སོར་རྟོག་པའི་རྗེས་སུ་འཇུག་ཅིང་ཉན་ཐོས་ཀྱི་འབྲས་བུ་ཐོབ་པ་ལས་ལྡོག་པ་དང་།
en: to be in harmony with the discernment of what is certain to a hearer but still give up the attainment of the fruit of the hearer;

source: རང་སངས་རྒྱས་སུ་ངེས་པ་ལ་སོ་སོར་རྟོག་པའི་རྗེས་སུ་འཇུག་ཅིང་རང་སངས་རྒྱས་ཀྱི་འབྲས་བུ་ཐོབ་པ་ལས་ལྡོག་པ་དང་།
en: to be in harmony with the discernment of what is certain to a solitary buddha but still give up the attainment of the fruit of the solitary buddha;

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པ་སོ་སོར་རྟོག་པའི་རྗེས་སུ་འཇུག་ཅིང་སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་སྙིང་རྗེ་བ་སྟེ།
en: and to be in harmony with the discernment of the untroubled state of a bodhisatva but still have compassion for all beings

source: སྲིང་མོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཡང་དག་ཕུལ་ལོ། །
en: —this, sister, is how the bodhisatva adopts vigor.

source: སྲིང་མོ་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱ་མཚོ་ཆེན་པོར་འཇུག་པ་ནི་སླའི། རིན་པོ་ཆེ་ཆེན་པོ་དག་ཐོགས་ཏེ་ལྡོག་པར་ནི་དཀའོ། །
en: “Just as, sister, it is easy to enter the ocean but hard to get hold of the great pearls and to return,

source: སྲིང་མོ་དེ་བཞིན་དུ་སྟོང་པ་ཉིད་ལ་སོ་སོར་རྟོག་པ་ནི་སླའི། ཐབས་ལ་མཁས་པ་དང་བྲལ་བས་ལྡོག་པར་ནི་དཀའོ། །
en: in the same way, sister, reflecting on emptiness is easy but returning from it is difficult for one who has no expedient means.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། ཉན་ཐོས་ཀྱི་སྐྱོན་མེད་པ་དང་། རང་སངས་རྒྱས་ཀྱི་སྐྱོན་མེད་པ་ལ་ཡང་སོ་སོར་བརྟག་པར་ནི་སླའི། ཐབས་ལ་མཁས་པ་དང་བྲལ་བས་ལྡོག་པར་ནི་དཀའོ། །
en: Reflecting on the absence of distinguishing marks, wishes, and conditioning, the absence of birth and origination, and the untroubled states of the hearers and the solitary buddhas is easy, but returning from such reflections is difficult for one who has no expedient means.

source: སྲིང་མོ་འདི་ལྟ་སྟེ་དཔེར་ན། གཡུལ་ངོ་ཆེན་པོར་འཇུག་པར་ནི་སླའི། མ་སྨས་མ་ཉམས་པར་རྒལ་བར་ནི་དཀའོ། །
en: Just as, sister, it is easy to enter a great battle but hard to get out unscathed and without injuries,

source: སྲིང་མོ་དེ་བཞིན་དུ་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དུ་ཡང་འཇུག་པར་ནི་སླའི། ཐབས་ལ་མཁས་པ་དང་བྲལ་བས་ལྡོག་པར་ནི་དཀའོ། །
en: in the same way, sister, entering the three gates of liberation is easy but returning is difficult for one who has no expedient means.”

source: བུ་མོས་སྨྲས་པ། འཇམ་དཔལ་ཐབས་ཞེས་བགྱི་བ་ཇི་ལྟ་བུ་ལགས།
en: “What, Mañjuśrī, is expedient means like?” asked the girl.

source: སྲིང་མོ་ཐབས་ཞེས་བྱ་བ་ནི་གང་ཕྱོགས་གཉིས་མི་སྤོང་བ་སྟེ། འདི་ལྟར་འཁོར་བའི་ཕྱོགས་དང་། མྱ་ངན་ལས་འདས་པའི་ཕྱོགས་སོ། །
en: “Expedient means, sister, is not giving up the two opposite sides, that is, the side of existence and the side of nirvāṇa.

source: སྲིང་མོ་ཐབས་ཞེས་བྱ་བ་ནི་གང་སྒོ་གཉིས་སྟོན་པར་བྱེད་པ་སྟེ། འཁོར་བའི་སྒོ་དང་། མྱ་ངན་ལས་འདས་པའི་སྒོ་དང་།
en: Expedient means, sister, is demonstrating the dual gates, that is, the gate of existence and the gate of nirvāṇa;

source: སྟོང་པ་ཉིད་ཀྱི་སྒོ་དང་། ལྟ་བ་ལས་རབ་ཏུ་ཐར་བའི་སྒོ་དང་།
en: the gate of emptiness and the gate of freedom from viewpoints;

source: མཚན་མ་མེད་པའི་སྒོ་དང་། མཚན་མ་ལས་རྣམ་པར་ཐར་པའི་སྒོ་དང་།
en: the gate of the absence of distinguishing marks and the gate of freedom from distinguishing marks;

source: སྨོན་པ་མེད་པའི་སྒོ་དང་། བསམས་བཞིན་དུ་སྐྱེ་བའི་སྒོ་དང་།
en: the gate of the absence of wishes and the gate of being born intentionally;

source: མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་སྒོ་དང་། དགེ་བ་མངོན་པར་འདུ་བྱ་བའི་སྒོ་དང་།
en: the gate of the absence of conditioning and the gate of the conditioning of virtue;

source: སྐྱེ་བ་མེད་པའི་སྒོ་དང་། སྐྱེ་བ་ཀུན་དུ་སྟོན་པའི་སྒོ་དང་།
en: the gate of no birth and the gate of demonstrating birth;

source: འབྱུང་བ་མེད་པའི་སྒོ་དང་། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་སྒོ་དང་།
en: the gate of no activity and the gate of the aggregates, the sensory elements, and the sense sources;

source: སྐྱེ་བ་མེད་ཅིང་འགག་པ་མེད་པའི་སྒོ་དང་། སྐྱེ་བ་དང་འབྱུང་བའི་སྒོ་དང་།
en: the gate of no origination and destruction and the gate of birth and activity;

source: དབེན་པའི་སྒོ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྒོ་དང་།
en: the gate of voidness and the gate of bringing beings to maturity;

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྒོ་དང་། ཆོས་ཐམས་ཅད་སོ་སོར་སྲུང་བའི་སྒོ་དང་།
en: the gate of total reality and the gate of caring for every single thing;

source: ཉན་ཐོས་ཀྱི་ཐེག་པའི་སྒོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པའི་སྒོ་དང་།
en: the gate of the way of the hearers and the gate of the determination of the bodhisatva;

source: རང་བྱང་ཆུབ་ཀྱི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མི་བརྗེད་པའི་སྒོ་སྟེ།
en: and the gate of isolated awakening and the gate of never forgetting the qualities of the Buddha.

source: སྲིང་མོ་བྱང་ཆུབ་སེམས་དཔའ་གང་སྒོ་གཉིས་ཉེ་བར་སྟོན་ཀྱང་། སྒོ་ཐམས་ཅད་ལ་ཡང་ཆགས་པ་མེད་པ་དེ་ནི་ཐབས་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: “Sister, the bodhisatva who demonstrates the dual gates but does not become attached to any gate is said to be able in expedient means.

source: དེ་བཞིན་དུ་འདོད་ཆགས་ཀྱི་སྒོ་དང་། འདོད་ཆགས་དང་བྲལ་བའི་སྒོ་དང་། ཞེ་སྡང་གི་སྒོ་དང་། ཞེ་སྡང་དང་བྲལ་བའི་སྒོ་དང་། གཏི་མུག་གི་སྒོ་དང་། གཏི་མུག་དང་བྲལ་བའི་སྒོ་དང་། ཉོན་མོངས་པའི་སྒོ་དང་། ཉོན་མོངས་པ་དང་བྲལ་བའི་སྒོ་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྒོ་དང་། འགྲོ་བ་མེད་པའི་སྒོ་སྟེ།
en: The same goes for the gate of desire and the gate of the absence of desire, the gate of aversion and the gate of the absence of aversion, the gate of bewilderment and the gate of the absence of bewilderment, the gate of the afflicted mental states and the gate of the absence of the afflicted mental states, and the gate of all movement and the gate of the absence of movement.

source: སྲིང་མོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ལ་མཁས་པའོ། །
en: That, sister, is the bodhisatva’s ability in expedient means.

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་སྤྱོད་པའི་སྒོ་དང་། སློབ་པ་དང་། མི་སློབ་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་གང་ཡིན་པ་དེ་གཉིས་ཤེས་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ལ་མཁས་པ་ཞེས་བྱའོ།། །།
en: “The gate of the behavior of ordinary, naive beings on the one hand, and the gate of the behavior of one to be trained, one without need of further training, the hearer, the solitary buddha, and the bodhisatva on the other—knowledge of these two gates is the bodhisatva’s ability in expedient means.”

source: ཡང་དེའི་ཚེ་ན་བཅོམ་ལྡན་འདས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རིའི་ངོས་ཀྱི་སྨན་ལྗོངས་ཞིག་ན་ཞབས་འབྲིང་བྱེད་པའི་དགེ་སྦྱོང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་ཐབས་ཅིག་ཏུ་རིང་དུ་འཆགས་པས་འཆག་ཅིང་བཞུགས་སོ། །
en: At that time, as the Blessed One was walking in the mountain forest on the slopes of Vulture Peak with his attendant, the venerable monk Ānanda, he sat down.

source: དེར་བཞུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འཇམ་དཔལ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཡང་དག་ཕུལ་དང་ཐབས་ལ་མཁས་པ་ཇི་སྐད་བསྟན་པ་དེ་ནི་དེ་བཞིན་ཏེ། ལེགས་སོ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་པ་དང་།
en: Once he was seated, he commended the princely Mañjuśrī: “Mañjuśrī, you taught how a bodhisatva adopts vigor and his ability in expedient means just the way it is. This is very good! Very good!”

source: ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དབྱངས་ཀྱིས་གོ་བར་གྱུར་ཅིང་། ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་དེ་ཉིད་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་པར་ཡང་གྱུར་ནས་
en: This whole trichiliocosm was filled with the melody of those words “very good,” and it shook six times.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་རྣམས་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་མང་པོ་དག་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་དེས་བསྐུལ་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནསབཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Inspired by those words “very good,” the gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, mahoragas, humans, non-humans, Śakra, Brahmā, and many protectors of the world went to the place where the Blessed One was residing, greeted him by bowing their heads to the Blessed One’s feet, and sat down at one side.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When they had seated themselves, the gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, mahoragas, humans, non-humans, Śakra, Brahmā, and many protectors of the world asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་བགྱི་བའི་སྒྲ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དབྱངས་ཀྱིས་གོ་བར་མཛད་པ་དེ་བཅོམ་ལྡན་འདས་ཀྱིས་སུ་ལ་སྩལ།
en: “To whom did the Blessed One utter the words ‘very good’ that filled this whole trichiliocosm with their melody?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: ལྷའི་བུ་དག་དེ་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལའོ། །
en: “Gods, it was to the princely Mañjuśrī.”

source: ལྷའི་བུ་རྣམས་ཀྱིས་གསོལ་པ།
en: The gods then asked,

source: བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དེ་ད་ལྟར་གང་ན་མཆིས།
en: “Blessed One, where is the princely Mañjuśrī now?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་དག་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་ཤར་ཕྱོགས་ཀྱི་སྒོ་ན། སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་ཞེས་བྱ་བ་དང་། ལྷན་ཅིག་ཏུ་ཆོས་དང་ལྡན་པའི་གཏམ་ཟེར་ཞིང་འདུག་གིས་
en: “Gods,” answered the Blessed One, “the princely Mañjuśrī is at the eastern gate of the great city of Rājagṛha, and is engaged in conversation on the Dharma with the courtesan’s daughter Suvarṇottama­prabhāśrī.

source: ལྷའི་བུ་དག་གང་དག་ཆོས་ཉན་པར་འདོད་པ་དག་ཀྱང་དེར་དེང་ཤིག །
en: Those gods who wish to hear the Dharma should go there.”

source: དེ་ནས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་ལྷན་ཅིག་ཏུ་འདུས་ནསའཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་།
en: Then all of those gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, mahoragas, humans, non-humans, Śakra, Brahmā, and many protectors of the world gathered and went to the place where the princely Mañjuśrī was residing.

source: ལུས་རགས་པར་སྤྲུལ་ནས་མེ་ཏོག་གི་ཆར་རབ་ཏུ་ཕབ་སྟེ།
en: They manifested themselves in physical bodies and showered a rain of flowers.

source: མེ་ཏོག་གི་ཆར་དེས་རྒྱལ་པོའི་ཁབ་ཀྱི་ཁོ་ར་ཁོར་ཡུག་ཏུ་མེ་ཏོག་ཆལ་བར་བཀྲམ་པར་གྱུར་ཏོ། །
en: That rain of flowers spread bouquets of flowers all over Rājagṛha and the surrounding area.

source: དེ་ན་ལྷ་རྣམས་ཀྱིས་ཀྱང་མི་རྣམས་མཐོང་ཞིང་མི་རྣམས་ཀྱིས་ཀྱང་ལྷ་རྣམས་ཀྱང་མཐོང་སྟེ། ཕན་ཚུན་སྨྲ་བར་ནི་མི་བྱེད་དོ། །
en: There, the gods could see the humans, and the humans could see the gods, but they did not speak to each other.

source: དེ་ལྟར་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དག་མེ་ཏོག་དེ་དག་གིས་ཀྱང་བསྐུལ། ལྷའི་ལུས་རགས་པ་དེ་དག་གིས་ཀྱང་བསྐུལ་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ག་ལ་བ་དེར་དོང་ངོ་། །
en: Many hundreds of thousands of beings from the great city of Rājagṛha who had been inspired by the flowers, and who had been inspired by the visible bodies of the gods, went to the place where the princely Mañjuśrī was staying.

source: རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ཡང་བུད་མེད་ཀྱི་ཚོགས་རྣམས་ཀྱིས་བསྐོར་ཏེ། དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་པོའི་འབྱོར་པ་ཆེན་པོ་དང་། རྒྱལ་པོའི་མཐུ་ཆེན་པོས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ག་ལ་བ་དེར་སོང་ནས།
en: King Ajātaśatru, surrounded by his retinue of women, with his armed forces of the four branches, and with his great royal wealth and his great royal might, also went to the place where the princely Mañjuśrī was staying.

source: འཁོར་དེ་དང་། རྒྱལ་པོ་མ་སྐྱེས་དགྲ་དང་། རྒྱལ་པོ་དང་བློན་པོའི་བུ་རྣམས་དང་། ཚོང་དཔོན་དང་ཁྱིམ་བདག་གི་བུ་རྣམས་ཀྱིས་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་དེ་འདོད་ཆགས་ཀྱིས་ཉོན་མོངས་པའི་ཀུན་ནས་ལྡང་བ་དང་བྲལ་ཏེ
en: The retinue, the king, the ministers, the sons of the ministers, the traders, and the sons of the householders all saw that the courtesan’s daughter Suvarṇottama­prabhāśrī was free from the manifestation of the afflicted mental state of desire.

source: དབང་པོ་དང་སྤྱོད་ལམ་རབ་ཏུ་ཞི་ཞིང་
en: Her senses and her behavior were calm.

source: དབང་པོ་མི་གཡེང་ལ་ངོ་ཚ་ཤེས་པ་དང་། དཔལ་གྱིས་ལེགས་པར་བརྒྱན་པར་མཐོང་ངོ་། །
en: Her senses were undisturbed, full of modesty, and she was adorned with beauty.

source: མཐོང་ནས་ཀྱང་དེ་ལ་ཕྱིན་ཅད་སུ་ཡང་འདོད་པའི་རྣམ་པར་རྟོག་པ་མི་སྐྱེ་བར་གྱུར་ཏོ། །
en: When they saw her, none of them gave rise to lustful thoughts.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་འདུས་པར་རིག་ནས། སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: When he saw that great crowd of people, the princely Mañjuśrī said to the courtesan’s daughter Suvarṇottama­prabhāśrī,

source: བུ་མོ་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ཐམས་ཅད་ཀྱིས་ཁྱོད་མཐོང་ཡང་ཕྱིར་ཞིང་ཆགས་པ་མེད་ན།
en: “My child, this great crowd of people is no longer filled with desire upon seeing you.

source: ཁྱོད་ཀྱིས་ཉོན་མོངས་པ་དེ་དག་གང་དུ་བཞག །
en: Where have you disposed of those afflicted mental states?”

source: བུ་མོས་སྨྲས་པ། འཇམ་དཔལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་རྣམས་ནི་ཡེ་ཤེས་དང་རྣམ་པར་གྲོལ་བ་ལ་གནས་པ་དང་།
en: “The afflicted mental states of all beings, Mañjuśrī, are located within knowledge and liberation,” answered the girl.

source: ཆོས་ཀྱི་དབྱིངས་ལ་གནས་པ་སྟེ། དེ་དག་ཀྱང་མ་བསྐྱེད་པ་དང་། མ་བཀག་པ་དང་། མ་བསྒྱུར་བར་དེ་ལྟར་བདག་གིས་རྟོགས་སོ། །
en: “They are placed within the totality of phenomena, and I have understood them thus as being without origination, without destruction, and without change.

source: ཉོན་མོངས་པའི་རང་བཞིན་གང་ལགས་པ་དེ་ཡང་བདག་གིས་རྟོགས་ལགས་སོ། །
en: This essential nature of the afflicted mental states is what I have understood.”

source: བུ་མོ་ཉོན་མོངས་པའི་རང་བཞིན་དེ་གང་ཡིན།
en: “My child, what is the essential nature of the afflicted mental states?”

source: འཇམ་དཔལ་རྟོག་པ་མ་མཆིས་ཤིང་རྣམ་པར་རྟོག་པ་མ་མཆིས་པའི་རང་བཞིན་ནི་ཉོན་མོངས་པའི་རང་བཞིན་ལགས་སོ། །
en: “The essential nature of the afflicted mental states, Mañjuśrī, is an essential nature beyond construction and concept.

source: ཚུལ་བཞིན་མ་ལགས་པ་མ་སྐྱེས་པའི་རང་བཞིན་ནི་ཉོན་མོངས་པའི་རང་བཞིན་ལགས་སོ། །
en: The essential nature of the afflicted mental states is a fundamentally unborn essential nature.

source: ཉོན་མོངས་པ་རྣམས་ནི་གློ་བུར་ཏེ།
en: The afflicted mental states are adventitious.

source: སྟོང་པ་ཉིད་རྟོགས་པ་དང་ལྷན་ཅིག་མི་གནས་སོ། །
en: They do not remain when emptiness is understood.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ཤེས་པ་དང་ལྷན་ཅིག་མི་གནས་སོ། །
en: They do not remain when the absence of distinguishing marks and the absence of wishes is known.

source: རང་བཞིན་གྱིས་འོད་གསལ་བ་དང་ལྷན་ཅིག་མི་གནས་སོ། །
en: They do not remain when the originally pure light is present.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན། དུག་དྲག་པོའི་སྦྲུལ་གདུག་པས་བལྟས་པ་ཙམ་གྱིས་སྐྱེ་བོ་འགུམ་པར་འགྱུར་བ་ལས་དེར་མི་ཞིག་གིས་དུག་ཐམས་ཅད་འཇིལ་བ་དང་། དུག་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པའི་སྨན་གནོད་སེལ་ཅེས་བགྱི་བ་འཚལ་ཏེ་མཆིས་ནསདེ་ནས་སྨན་དེ་བསྟན་མ་ཐག་ཏུ་སྦྲུལ་གདུག་པའི་དུག་དེ་མ་མཆིས་པར་བགྱིས་ནས་
en: “Mañjuśrī, people can be killed by the poison of a highly venomous snake, but if they ingest the antivenom called agada , which neutralizes and pacifies all poison, then, as soon as the drug is administered, the poison of the venomous snake is made innocuous.

source: དེ་ལ་ཁྱེའུ་དང་བུ་མོ་རྣམས་བརྩེ་བས་རྩེ་ཞིང་།
en: Thus, boys and girls who ingest it can lovingly play with the snake.

source: ཁྱེའུ་དང་བུ་མོ་དེ་དག་སྦྲུལ་གདུག་པ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་བར་བགྱིད་དེ། པང་པར་ལེན་ཅིང་གློ་ལ་སེ་རལ་ཕྲེང་དུ་བཏགས་ཏེ།
en: When they play with the snake, they may take it on their laps and wear it on one side as a shoulder belt.

source: རྒྱན་དུ་བགྱིས་ཀྱང་ཚིག་པར་མི་བགྱིད། ཟ་བར་མི་བགྱིད། སྡུག་བསྔལ་དུ་མི་བགྱིད་དོ། །
en: But even though they adorn themselves with it, it will not hurt, consume, or inflict harm on them.

source: འཇམ་དཔལ་དེ་བཞིན་དུ་བདག་ཀྱང་སྔོན་ཆོས་འདུལ་བ་མ་ཐོས་པས་ཚུལ་བཞིན་མ་ལགས་པ་ཡིད་ལ་བགྱིད་པ་ཕྱིན་ཅི་ལོག་ལ་ཉེ་བར་གནས་པའི་ཉོན་མོངས་པས་ཡོངས་སུ་བསྲེགས་པ་ན་
en: “In the same way, Mañjuśrī, I had not previously heard of the discipline of the Dharma and was burned by the afflicted mental states that were brought about by superficial mental activity and misunderstanding.

source: འདོད་ཆགས་ཀྱིས་རང་གི་ལུས་ལ་ཆགས་ཤིང་རང་གི་གཟུགས་ལ་མངོན་པར་ཞེན་ཏེགཟུགས་དབུ་བ་ལྟ་བུར་སོ་སོར་རྟོག་པར་མི་བགྱིད།
en: I was attached to my own body by desire, I was attached to my beauty, and I did not reflect upon the fact that beauty is just as fragile as foam.

source: ལུས་སྒྱུ་མའི་ཆོས་ཉིད་དུ་མ་འཚལ།
en: I did not understand that the body has the nature of an illusion.

source: དགའ་བའི་རྩེད་མོ་རྨི་ལམ་ལྟ་བུར་མ་འཚལ།
en: I did not understand that playing with pleasures is like a dream.

source: འདོད་པའི་དགའ་བའི་རོ་མྱང་བ་སྦྲང་རྩིའི་ཐིགས་པ་ལྟ་བུར་མ་འཚལ།
en: I did not understand that the taste of the pleasure of desire is like a drop of honey.

source: སྲོག་གི་དབང་པོ་ཟིལ་པའི་ཐིགས་པ་ལྟ་བུར་མ་འཚལ།
en: I did not understand that the life principle is like dewdrops.

source: འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་པར་མ་འཚལ།
en: I did not understand that all composite things are impermanent.

source: ལུས་མི་སྡུག་པར་མ་འཚལ།
en: I did not understand that the body is impure.

source: འདུ་བྱེད་ཐམས་ཅད་ཤིན་ཏུ་སྡུག་བསྔལ་བར་མ་འཚལ་ཞིང་། ཆོས་ཐམས་ཅད་བདག་མ་མཆིས་པར་སོ་སོར་རྟོག་པར་མི་བགྱིད་
en: I did not understand that all composite things are intense suffering, and I did not reflect on the fact that all phenomena are without any self.

source: དེ་བདག་ཀྱང་མུན་པ་མུན་ནག་གིས་བསྒྲིབས་ཤིང་། གཞན་ལ་ཡང་མུན་པར་བགྱིད།
en: I was thus obscured by darkness myself and I also obscured others.

source: བདག་ཀྱང་བཅིངས་ཤིང་གཞན་ལ་ཡང་འཆིང་བར་བགྱིད་པ་ལས།
en: I was bound myself and I bound others as well.

source: འཇམ་དཔལ་གང་གི་ཚེ་བདག་གིས་ཁྱོད་ལས་ཆོས་དང་ལྡན་པའི་བཀའ་མཆིད་ཐོས་ཏེ
en: “I heard your teaching on the Dharma, Mañjuśrī, and when I heard it, I had faith in it.

source: ཐོས་ནས་ཀྱང་མོས་ཤིང་མོས་ནས་ཀྱང་རྣམ་པར་གྲོལ་ཏེ་དེའི་སླད་དུ་བདག་ད་ལྟར་དང་སླན་ཆད་ཆགས་པའི་མིག་གིས་སུ་ལ་ཡང་ལྟ་བར་མི་བགྱིད་དོ། །
en: When I had attained faith in it, I was freed, and so I will not look upon anyone with desirous eyes, neither in the present nor in the future.

source: འཇམ་དཔལ་སྣང་བ་ནི་མུན་པ་དང་ལྷན་ཅིག་མི་གནས་སོ། །
en: Mañjuśrī, light does not coexist with darkness.

source: འཇམ་དཔལ་དེ་བཞིན་དུ་འདོད་ཆགས་དང་བྲལ་བ་ནི་སུ་ཡང་ཉོན་མོངས་པ་རྣམས་ལ་ཆགས་པ་མ་མཆིས་པའི་སླད་དུའོ། །
en: In the same way, Mañjuśrī, no one who is free of desires is attached to the afflicted mental states.”

source: དེ་ནས་ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་གྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the courtesan’s daughter Suvarṇottama­prabhāśrī implored the princely Mañjuśrī,

source: ཀྱེ་མ་འཇམ་དཔལ་ལྷའི་འཁོར་དང་། མིའི་འཁོར་ཆེན་པོ་འདི་འདུས་ཀྱིས། གང་གིས་ལྷ་དང་མི་འདི་དག་གིས་ཉོན་མོངས་པའི་རང་བཞིན་དེ་དག་རྟོགས་ནས་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་ཀྱི་བཀའ་མཆིད་བགྱི་བར་ཁྱོད་སྤོབས་པར་མཛོད་ཅིག །
en: “Please, Mañjuśrī, as these great assemblies of gods and humans are gathered here, be eloquent in your speech on the Dharma so that when they have understood the essential nature of the afflicted mental states, these gods and these people will develop the mind of absolute, incomparable awakening out of compassion for living beings.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། སྲིང་མོ་ཉོན་མོངས་པའི་རང་བཞིན་ལ་ནི་མོས་པར་དཀའོ། །
en: “But sister,” replied Mañjuśrī, “the essential nature of the afflicted mental states is very difficult to reach.

source: སྲིང་མོ་ཉོན་མོངས་པའི་རང་བཞིན་ནི་བྱང་ཆུབ་ཡིན་པའི་ཕྱིར་རོ། །
en: Because the essential nature of the afflicted mental states is awakening.

source: སྲིང་མོ་འདི་ལྟ་སྟེ་དཔེར་ན། མེ་མ་སྦར་བ་ནི་སྲེག་པའི་བདག་ཉིད་མ་ཡིན་ནོ། །
en: “Sister, just as an unkindled fire does not have the nature of burning,

source: སྲིང་མོ་དེ་བཞིན་དུ་ཉོན་མོངས་པ་ཡང་ཡོངས་སུ་མ་བརྟགས་ན་འཁོར་བའི་བདག་ཉིད་མ་ཡིན་ནོ། །
en: in the same way, sister, the afflicted mental states that are not imagined do not have the nature of existence.

source: སྲིང་མོ་འདི་ལྟ་སྟེ་དཔེར་ན། མེ་སྦར་བ་ནི་སྲེག་པའི་བདག་ཉིད་ཡིན་ནོ། །
en: Sister, just as a kindled fire has the nature of burning,

source: སྲིང་མོ་དེ་བཞིན་དུ་ཉོན་མོངས་པ་ཡང་ཡོངས་སུ་བརྟགས་ན་འཁོར་བའི་བདག་ཉིད་ཡིན་ནོ། །
en: in the same way, sister, the afflicted mental states that are imagined have the nature of existence.

source: སྲིང་མོ་འདི་ལྟ་སྟེ་དཔེར་ན། མེ་ནི་རྒྱུ་ཡོད་ན་འབར་རོ། །
en: “Sister, just as a fire burns if it has a cause,

source: སྲིང་མོ་དེ་བཞིན་དུ་ཉོན་མོངས་པ་རྣམས་ཀྱང་ལྟ་བའི་ཀུན་ནས་ལྡང་བའི་རྒྱུ་ཡོད་ན་ཁམས་གསུམ་དུ་འབར་རོ། །
en: in the same way, sister, if the afflicted mental states have the cause of the manifestation of viewpoints, they burn in the three spheres of existence.

source: སྲིང་མོ་འདི་ལྟ་སྟེ་དཔེར་ན། མེ་ནི་རྒྱུ་མེད་ན་མི་འབར་རོ། །
en: Sister, just as a fire does not burn if it has no cause,

source: སྲིང་མོ་དེ་བཞིན་དུ་ཉོན་མོངས་པ་རྣམས་ཀྱང་ལྟ་བའི་ཀུན་ནས་ལྡང་བའི་རྒྱུ་མེད་ན་ཁམས་གསུམ་དུ་མི་འབར་རོ། །
en: in the same way, sister, if the afflicted mental states do not have the cause of the manifestation of viewpoints, they do not burn in the three spheres of existence.

source: སྲིང་མོ་འདི་ལྟ་སྟེ་དཔེར་ན། ལོ་སྟོང་དུ་འབར་བའི་མེ་ལ་ནི་སྐྱེ་བ་དང་འབྲི་བ་མེད་དོ། །
en: “Sister, just as there is no increase or decrease in a thousand-year fire,

source: སྲིང་མོ་དེ་བཞིན་དུ་བསྐལ་པ་བརྒྱ་སྟོང་དུ་རྒྱུ་བའི་ཉོན་མོངས་པ་ལ་ཡང་སྐྱེ་བ་དང་འབྲི་བ་མེད་དོ། །
en: in the same way, sister, there is no increase or decrease in the afflicted mental states generated over a hundred thousand eons.

source: སྲིང་མོ་འདི་ལྟ་སྟེ་དཔེར་ན། མེ་ཤི་བ་ལ་ནི་མེ་ཞེས་མི་གདགས་སོ། །
en: “Sister, just as a fire that has been extinguished cannot be called a fire,
